Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailMaterial(Autodesk.Revit.DB.ElementId)
Checks whether an ElementId is a valid material Id of a non-continuous rail.
materialId:
The material Id to be checked.
Returns:
True if the ElementId refers to a valid material or it is invalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailProfile(Autodesk.Revit.DB.ElementId)
Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.
Remarks:
Autodesk.Revit.DB.ElementId.InvalidElementId is considered a valid NonContinuousRail profile (the default profile).
profileId:
The profile Id to be checked.
Returns:
True if the ElementId refers to a valid NonContinuousRail profile, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.IsValidNonContinuousRailName(System.String)
Checks whether the input name is valid for a non-continuous rail in its associated railing type.
Remarks:
The name must be unique within the Autodesk::Revit::DB::Architecture::RailingType
to which the non-continuous rail belongs.
name:
The name to be checked.
Returns:
True if the name is unique for the Autodesk::Revit::DB::Architecture::RailingType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.MaterialId
The material id associated with the non-continuous rail, or invalidElementId if none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The materialId is not a valid value to be used as a non-continuous rail material Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.ProfileId
The profile id of the non-continuous rail, or invalidElementId if none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profileId is not an Id of a valid NonContinuousRail profile.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Name
The name of the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: The name name is not valid for the non-continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2019